perf/cases/metar/metar-no-cache.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      payload:
        path: "../../data/metar_stations.csv"
        order: "random"
        fields: 
          - "station"
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ramp [1]
      duration: 20
      arrivalRate: 5
      rampTo: 10
    - name: Plain [1]
      duration: 30
      arrivalRate: 10
    - name: Spike [1]
      duration: 10
      arrivalRate: 60
    - name: Plain [2]
      duration: 30
      arrivalRate: 25
    - name: Ramp [2]
      duration: 20
      arrivalRate: 25
      rampTo: 10
    - name: Spike [2]
      duration: 10
      arrivalRate: 75
    - name: Plain [3]
      duration: 30
      arrivalRate: 1
    - name: Spike [3]
      duration: 45
      arrivalRate: 125
    - name: Plain [3]
      duration: 40
      arrivalRate: 50
    - name: Ramp [Shutdown]
      duration: 20
      arrivalRate: 50
      rampTo: 0
    

scenarios:
  - name: METAR [No Cache]
    flow:
      - get:
          url: "/metar?station={{ station }}"